app/controllers/countries_controller.rb

INSERT INTO "countries" ("created_at", "country", "updated_at", "currency") VALUES('2010-06-05 21:16:09', 'United States Of America', '2010-06-05 21:16:09', 'USD')
---
  def create
    @country = Country.new(params[:country])
    if @country.save

SELECT * FROM "countries"
---
  def index
    @countries = Country.all

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE (country_id = 1 AND provider_type = 'fixed')
---
  def show
    @country = Country.find(params[:id])
    #@fixed_providers, @mobile_providers = [],[]
    @fixed_providers = Provider.find(:all,
      :conditions => ["country_id = ? AND provider_type = ?", @country.id, "fixed"])

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
---
  def edit
    @country = Country.find(params[:id])

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
UPDATE "countries" SET "currency" = 'USDD', "updated_at" = '2010-05-01 04:51:43' WHERE "id" = 1
---
  def update
    @country = Country.find(params[:id])
    if @country.update_attributes(params[:country])

SELECT * FROM "countries" WHERE ("countries"."id" = 2)
DELETE FROM "countries" WHERE "id" = 2
---
  def destroy
    @country = Country.find(params[:id])
    @country.destroy