app/controllers/plans_controller.rb

  def new
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)

  def create
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
    @plan = Plan.new(params[:plan])
    @plan.provider = @provider

    if @plan.save
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)
INSERT INTO "plans" ("name", "tax", "night_usage_unit", "usage", "created_at", "cost", "highproduct", "provider_id", "incremental_unit", "lowcost", "updated_at", "night", "overage", "dayoverage", "usage_unit", "day", "speed_unit", "lowproduct", "speed", "plan_type", "description", "highcost", "day_usage_unit") VALUES('Basic Wireless', 0.0, 'KB', 0.0, '2010-06-08 13:07:02', 0.0, 'dubar', 9, 'KB', 49.99, '2010-06-08 13:07:02', 0.0, 0.0, 0.0, 'KB', 0.0, 'KB', 'fubar', 0.0, 'Prepaid', 'sdjh', 99.99, 'KB')

  def edit
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
    @plan = Plan.find(params[:id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)
SELECT * FROM "plans" WHERE ("plans"."id" = 1)

  def update
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
    @plan = Plan.find(params[:id])

    if @plan.update_attributes(params[:plan])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)
SELECT * FROM "plans" WHERE ("plans"."id" = 1)
UPDATE "plans" SET "incremental_unit" = 'GB', "updated_at" = '2010-05-05 23:46:59' WHERE "id" = 3

  def destroy
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
    @plan = Plan.find(params[:id])
    @plan.destroy
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)
SELECT * FROM "plans" WHERE ("plans"."id" = 1)
DELETE FROM "plans" WHERE "id" = 1

  def show
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:provider_id])
    @plan = Plan.find(params[:id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers"."id" = 1)
SELECT * FROM "plans" WHERE ("plans"."id" = 1)