app/controllers/providers_controller.rb

  def show
    @provider = Provider.find(params[:id])
    @country = Country.find(params[:country_id])
---
SELECT * FROM "providers" WHERE ("providers"."id" = 3)
SELECT * FROM "countries" WHERE ("countries"."id" = 2)

  def new
    @provider = Provider.new
    @country = Country.find(params[:country_id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)

  def create
    @provider = Provider.new(params[:provider])
    @country = Country.find(params[:country_id])
    @provider.country = @country
    if @provider.save
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
INSERT INTO "providers" ("name", "created_at", "highproduct", "updated_at", "lowcost", "country_id", "installation", "lowproduct", "highcost", "provider_type") VALUES('askhjk', '2010-06-05 21:16:24', 'jhghjg', '2010-06-05 21:16:24', 55.0, 5, 100.0, 'lsajlk', 66.0, 'Mobile')

  def edit
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 2)
SELECT * FROM "providers" WHERE ("providers"."id" = 3)

  def update
    @country = Country.find(params[:country_id])
    @provider = Provider.find(params[:id])
    if @provider.update_attributes(params[:provider])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 2)
SELECT * FROM "providers" WHERE ("providers"."id" = 3)
UPDATE "providers" SET "updated_at" = '2010-05-01 05:41:49', "provider_type" = 'fixed' WHERE "id" = 3

  def destroy
    @provider = Provider.find(params[:id])
    @provider.destroy
---
SELECT * FROM "providers" WHERE ("providers"."id" = 7)
DELETE FROM "providers" WHERE "id" = 7