app/controllers/search_controller.rb

  def result
    if params[:cid].nil? or params[:equip].nil? or params[:provider].nil?
      redirect_to :action => :default and return
    end
    @country = Country.find(params[:cid])
    equip = params[:equip]
    @graph = {}
    highest = nil
    @country.providers.select{|p| p.provider_type == @provider_type}.each do |port|
      port.plans.each do |plan|
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers".country_id = 1)
SELECT * FROM "plans" WHERE ("plans".provider_id = 1)

  def advanced
    @countries = Country.all
---
SELECT * FROM "countries"

  def advanced_result
  	#generate bar graph of plans in country or 3 lowest plans
  	if params[:usage].nil? or params[:usage_level].nil?
  	  redirect_to :action => :advanced and return
	  end
    @usage = 0
    @usage_unit = ''
    unless params[:usage].empty?
      @usage = params[:usage]
      @usage_unit = params[:usage_unit]
    else
      level = UsageLevel.find(params[:usage_level])
      @usage = level.amount
      @usage_unit = level.unit
    end
    #convert usage to MB
    usage_mb = convert_to_mb( @usage.to_f, @usage_unit )

    country_id = params[:country_id]
    country = Country.find(params[:country_id])
    @plans = {}
    @lowcost, @lowplan, lowplankey = nil
    country.providers.select{|p| p.provider_type == @provider_type}.each do |provider|
      provider.plans.each do |plan|
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "providers" WHERE ("providers".country_id = 1)
SELECT * FROM "plans" WHERE ("plans".provider_id = 1)