app/controllers/user_controller.rb

INSERT INTO "users" ("updated_at", "username", "password", "created_at") VALUES('2010-05-01 03:17:36', 'Test', '123456', '2010-05-01 03:17:36')
---
  def create
    @user = User.new(params[:user])
    @user.password = hash_password(@user.password)
    @user.password_confirmation = hash_password(@user.password_confirmation)
    if @user.save

SELECT * FROM "users" WHERE ("users"."username" = 'Test') LIMIT 1
---
  def do_login
    username = params[:username]
    password = params[:password]
    hashed_password = hash_password(password)
    @user = User.find_by_username(username)